---
kind: type
id: T:Autodesk.Revit.DB.Events.ViewExportedEventArgs
source: html/d0e95c70-c5f4-8b12-2f7a-5279ba667948.htm
---
# Autodesk.Revit.DB.Events.ViewExportedEventArgs

The event arguments used by the ViewExported event.

## Syntax (C#)
```csharp
public class ViewExportedEventArgs : RevitAPIPostDocEventArgs
```